[{"id":"_wr0fmgjnh","title":"Routing | Node.js","type":"technology","author":"Gil Pereira","text":"Routing refers to how an application’s endpoints (URIs) respond to client requests. For an introduction to routing, see Basic routing.\r\n\r\nYou define routing using methods of the Express app object that correspond to HTTP methods; for example, app.get() to handle GET requests and app.post to handle POST requests. For a full list, see app.METHOD. You can also use app.all() to handle all HTTP methods and app.use() to specify middleware as the callback function (See Using middleware for details).\r\n\r\nThese routing methods specify a callback function (sometimes called “handler functions”) called when the application receives a request to the specified route (endpoint) and HTTP method. In other words, the application “listens” for requests that match the specified route(s) and method(s), and when it detects a match, it calls the specified callback function.\r\n\r\nIn fact, the routing methods can have more than one callback function as arguments. With multiple callback functions, it is important to provide next as an argument to the callback function and then call next() within the body of the function to hand off control to the next callback operation.\r\n\r\nThe following code is an example of a very basic route.\r\n\r\nRoute paths, in combination with a request method, define the endpoints at which requests can be made. Route paths can be strings, string patterns, or regular expressions.\r\n\r\nThe characters ?, +, *, and () are subsets of their regular expression counterparts. The hyphen (-) and the dot (.) are interpreted literally by string-based paths.\r\n\r\nIf you need to use the dollar character ($) in a path string, enclose it escaped within ([ and ]). For example, the path string for requests at “/data/$book”, would be “/data/([\\$])book”.","date":"29.03.2021 | 18:37","edited":true,"editedDate":"29.03.2021 | 22:32"},{"id":"jsq0dh4b3","title":"A Mental Trick","type":"brainstorming","author":"Laura Vanderkam","text":"A few years ago, one of my children became obsessed with roller coasters. He watched video after video to study them from afar. He designed his own in computer games. There was just one problem: He was terrified of actually riding one.\r\n\r\nEventually, he identified the “Sooper Dooper Looper” at Hersheypark as a potential option: It wasn’t too tall or too fast, and had only one inversion. But when we actually went to the park, he started to lose his nerve. I knew he would regret it if he didn’t ride the roller coaster after all that, so I reminded him that in two minutes, the ride would be over. Even if he hated it, it was only two minutes (1:45, to be exact). I told him to picture himself on the other side of those two minutes.\r\n\r\nSo he did, and then he rode the coaster. And when it was over, he was really glad he’d tried it. I, meanwhile, was glad that a trick I use often had worked once again. This skill of picturing our future selves is fundamental for discipline — but it’s also important for happiness, which is just as important.\r\n\r\nHumans are pretty bad at picturing our future selves. Research has found that when we think about them, the brain regions that are activated are similar to those activated when we think about strangers — but not as much to those activated when we think about our current selves.\r\nThis may be one reason that people under-save for retirement. Or why we stay up too late — because, as Jerry Seinfeld once observed, a lack of sleep is “Morning Guy’s problem.” But the same research found that when people could actually see (simulated) pictures of their aged selves, then they made better choices.","date":"29.03.2021 | 22:26","edited":false},{"id":"4yrm22868","title":"Stopping Schizophrenia Before It Starts","type":"science","author":"Robert Kolker","text":"One night in the early 1960s, when he was about 17, a high school football star and all-state wrestler named Donald Galvin smashed 10 dishes to pieces — all at once, while standing in front of the kitchen sink.\r\n\r\nHis father wrote it off. So did his mother. Donald was a teenager, moody. It was the ’60s. Other kids were doing worse.\r\n\r\nBut Donald knew there was something wrong. He’d known for a while. He knew that being a star on the football field and having a friendship with another person were two very different things. Sometimes, he would say later, he thought of people as kind of like IBM cards he sorted through his own computer for information he could use. He knew that made him unusual. Increasingly often, he seemed completely oblivious — a stranger to his own motivations and actions. Something was happening, and he couldn’t figure out what. More than anything else, he was afraid.\r\n\r\nAlmost a decade later, in June 1970, a few weeks shy of his 25th birthday, Donald Galvin was arrested by police after trying to harm not just himself but his young wife. He was held in a city jail before being transferred to a state mental hospital. He’d be in and out of that hospital dozens of times in the decades to come, his illness managed with medications.","date":"29.03.2021 | 22:27","edited":false},{"id":"2edkep8h4","title":"Baseball Puts the Regular Back in Regular Season","type":"sport","author":"Tyler Kepner","text":"It was over as soon as it started, more or less, the strangest little season in the history of baseball. Sixty games were all we got, not even 10 weeks — fewer games than a pro basketball or hockey schedule, fewer weeks than an N.F.L. season.\r\n\r\n“Last year was a sprint, and I don’t know if everybody was prepared to sprint, not only on our team but on other teams as well,” said Dusty Baker, the manager of the Houston Astros. “It’s actually more fun playing 162, because then, let’s see who’s the strongest mentally, physically and as a unit.”\r\n\r\nThe new season, which starts on Thursday with all 30 teams in action, offers more than the usual gauzy promises of blue skies, green grass and the warmth of the sun. Actual human fans, at varying capacity levels, will see the return of baseball as usual: a six-month, everyday companion that should give us a new appreciation of the regular in regular season.\r\n\r\nThe Cubs’ season ended with two home losses in a newly created playoff tier that does not return for 2021. While 16 of the 30 teams qualified for the expanded field last October, this year it will be only 10: three division winners and two wild cards from each league.\r\n\r\nThe league and the players’ union could not agree on extending the expanded playoff arrangement for 2021, despite the clear benefits. The industry will be on edge until the sides agree on a new collective bargaining agreement, with the current one expiring Dec. 1. The sport might change significantly in 2022; traditional league affiliations could be shuffled, and the 162-game schedule — first introduced in 1961 — may be adjusted.\r\n\r\n“There is a lot of history there, and a lot of pride taken by players in playing what they experience as a full season,” Tony Clark, the executive director of the players’ association, said in an interview last week. “This is not to suggest that players aren’t willing to have a conversation about some other structure, both from an alignment standpoint, a how-the-games-are-scheduled standpoint, all the way to the number of games that are scheduled in a season.”\r\n\r\nIn the meantime, the old, familiar rhythms of the game will be a source of comfort for fans, a reminder of the timelessness of a sport that is easier than ever to follow. From an East Coast matinee to a West Coast night game, hours of daily broadcasts — on TV and radio — are as close as your smartphone. While typical basketball and hockey seasons last only 82 games, and football a mere 16, the sheer volume of baseball distinguishes it from the rest.","date":"29.03.2021 | 22:29","edited":true,"editedDate":"29.03.2021 | 22:31"}]